# Задание 5.2a
# Всё, как в задании 5.2, но, если пользователь ввел адрес хоста, а не адрес сети, надо преобразовать адрес хоста в адрес сети
# и вывести адрес сети и маску, как в задании 5.2.

# Пример адреса сети (все биты хостовой части равны нулю):
# 10.0.1.0/24
# 190.1.0.0/16

# Пример адреса хоста:
# 10.0.1.1/24 - хост из сети 10.0.1.0/24
# 10.0.5.195/28 - хост из сети 10.0.5.192/28

# Если пользователь ввел адрес 10.0.1.1/24, вывод должен быть таким:

# Network:
# 10        0         1         0
# 00001010  00000000  00000001  00000000

# Mask:
# /24
# 255       255       255       0
# 11111111  11111111  11111111  00000000
# Проверить работу скрипта на разных комбинациях хост/маска, например: 10.0.5.195/28, 10.0.1.1/24

# Подсказка:
# Есть адрес хоста в двоичном формате и маска сети 28. Адрес сети это первые 28 бит адреса хоста + 4 ноля.
# То есть, например, адрес хоста 10.1.1.195/28 в двоичном формате будет bin_ip = "00001010000000010000000111000011".
# А адрес сети будет первых 28 символов из bin_ip + 0000 (4 потому что всего в адресе может быть 32 бита, а 32 - 28 = 4):
# 00001010000000010000000111000000

# Ограничение: Все задания надо выполнять используя только пройденные темы.

print('\n')
ip_mask = input('Введите IP-сеть в формате: 10.1.1.0/24: ')
# ip_mask = '10.0.1.1/24'
ip = ip_mask[:-3]
mask = ip_mask[-2::]

ip_to_list = ip.split('.')
ip1, ip2, ip3, ip4 = ip_to_list

ip_bin1 = ('0' * (8 - len(bin(int(ip1))[2:]))) + bin(int(ip1))[2:]
ip_bin2 = ('0' * (8 - len(bin(int(ip2))[2:]))) + bin(int(ip2))[2:]
ip_bin3 = ('0' * (8 - len(bin(int(ip3))[2:]))) + bin(int(ip3))[2:]
ip_bin4 = ('0' * (8 - len(bin(int(ip4))[2:]))) + bin(int(ip4))[2:]

ip_bin = ip_bin1 + ip_bin2 + ip_bin3 + ip_bin4
network_address_bin = ip_bin[:-(32 - int(mask))] + '0' * (32 - int(mask))

nab1, nab2, nab3, nab4 = network_address_bin[0:8], network_address_bin[8:
                                                                       16], network_address_bin[16:24], network_address_bin[24:32]

mask_bin = '1' * int(mask) + '0' * (32 - int(mask))

# print('\n')
print('Network:')
print("{:10}{:10}{:10}{:10}".format(str(int(nab1, 2)), str(
    int(nab2, 2)), str(int(nab3, 2)), str(int(nab4, 2))))
print("{:08}  {:08}  {:08}  {:08}".format(
    int(nab1), int(nab2), int(nab3), int(nab4)))

print('\n')
print('Mask:')
print('/' + mask)
mask1, mask2, mask3, mask4 = mask_bin[0:
                                      8], mask_bin[8:16], mask_bin[16:24], mask_bin[24:32]
print("{:<10}{:<10}{:<10}{:<10}".format(int(mask1, 2),
      int(mask2, 2), int(mask3, 2), int(mask4, 2)))
print("{:10}{:10}{:10}{:10}".format(mask1, mask2, mask3, mask4))

print('\n')
